"""
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку 
здійснюється за механізмом 
student[outer_dict_key][inner_dict_key]

Є дані студентів (комбінація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення, 
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""

students = {
    'Іван Петров': {
        'Пошта': 'Ivan@gmail.com',
        'Вік': 14,
        'Номер телефону': '+380987771221',
        'Середній бал': 95.8
    },
    'Женя Курич': {
        'Пошта': 'Geka@gmail.com',
        'Вік': 16,
        'Номер телефону': None,
        'Середній бал': 64.5
    },
    'Маша Кера': {
        'Пошта': 'Masha@gmail.com',
        'Вік': 18,
        'Номер телефону': '+380986671221',
        'Середній бал': 80
    },
}
# ваш код нижче !!!!!!!! вище нічого не змінюємо

# Пункт 1
students['Дмитро Ковалевський'] = {
    'Пошта': 'Dmytro@gmail.com',
    'Вік': 21,
    'Номер телефону': '+380956692521',
    'Середній бал': 91,
}

# Пункт 2
for student, student_data in students.items():
    if student_data['Середній бал'] > 90:
        print(f"Student: {student} - Average score: {student_data['Середній бал']}")


# Пункт 3
avg_score_value = 0
sum_avg_score = 0

for student, student_data in students.items():
    if student_data['Середній бал']:
        sum_avg_score += student_data['Середній бал']
        avg_score_value += 1

if avg_score_value > 0:
    average = sum_avg_score / avg_score_value


# Пункт 4
for student, student_data in students.items():
    if student_data['Номер телефону'] is None:
        student_family_number = student_data.get('Номер телефону') or '+380990652522'

pass
